import { type FC } from "react";
import styles from "./Terms.module.scss";

const Terms: FC = () => {
    return (
        <section className={`${styles.privacyPolicy} container`} id="terms">
            <h2 className={styles.firstTitle}>Политика конфиденциальности</h2>
            <div className={styles.firstText}>
                <p className={styles.desc}>
                    ИП Сулуев Азамат Кылычбекович далее именуемое ‘Восток парк -
                    официальный партнёр сервиса Яндекс Про’ настоящим
                    делающее предложение о заключении договора, лицам,
                    находящимся на территории Кыргызской Республики, выступающие
                    по отдельности по настоящему договору  в зависимости от
                    вышеуказанных категорий присоединяемых лиц и именуемый
                    каждый в отдельности в дальнейшем «Поверенный» или
                    «Агрегатор», с одной стороны и Лицо, принявшее данную
                    оферту, именуемое в рамках настоящего Договора, далее
                    «Доверитель» или «Водитель» совместно именуемые «Стороны», а
                    по отдельности как указано выше, или «Сторона», заключили
                    согласно законодательству Кыргызской Республики, настоящий
                    публичный договор присоединения о нижеследующем:{" "}
                </p>
                <p className={styles.desc}>Термины и определения:   </p>
                <p className={styles.desc}>
                    Для целей настоящего договора нижеприведённые термины имеют
                    следующее значение. 
                </p>
                <p className={styles.desc}>
                    <span className={styles.semiBold}>Агрегатор</span> — ИП
                    Сулуев Азамат Кылычбекович далее именуемое ‘Восток парк -
                    официальный партнёр сервиса Яндекс Про’ для сотрудничества с
                    лицами, находящимися на территории Кыргызской Республики{" "}
                    <span className={styles.semiBold}>
                        в рамках настоящего Договора, так же поименованный
                        каждый в отдельности Поверенный
                    </span>
                    , организовавший, по поручению Доверителя, заключение
                    отдельных договоров либо присоединение к ним, которые
                    позволяют использовать сервисы Яндекса, осуществлять
                    транзитный перевод денег от клиентов, посредством агента,
                    через электронную площадку принадлежащую платежным
                    организациям ОсОО «BM Technologies» и/или ОсОО «Региональные
                    платежные системы» и/ или ОсОО «Грин Телеком Сервис» или
                    любую другую платежную систему и/или платежного
                    агента/субагента на усмотрение Агрегатора, водителю
                    (Доверителю). Агрегатором взимается с Доверителя комиссия в
                    рамках предоставления услуг. Агрегатор не является
                    таксопарком и/или диспетчерской службой такси в силу
                    осуществляемых им функций.
                </p>
                <p className={styles.desc}>
                    <span className={styles.semiBold}>Агрегация</span> –
                    деятельность Агрегатора, направленная на объединение
                    платежей от сервисов Яндекса, в пользу Водителя за услуги по
                    перевозке пассажиров и багажа и/или иные транспортные услуги
                    и/или услуги курьерской доставки, оказанные Водителем
                    множеству Клиентов и осуществления взаиморасчетов за
                    использование Водителем электронных приложений Яндекс. За
                    услуги агрегации Агрегатор удерживает с Водителя комиссию в
                    соответствии с положениями Договора.
                </p>
                <p className={styles.desc}>
                    <span className={styles.semiBold}>
                        Водитель — в рамках настоящего Договора, так же
                        поименованный Доверитель
                    </span>
                    , лицо, присоединившееся к настоящей Оферте, путем подачи
                    информации Поверенному для регистрации Сервисах Яндекс и
                    оказывающее услуги по перевозке пассажиров и багажа и/или
                    иные транспортные услуги и/или услуги курьерской доставки с
                    использованием поиска заказчиков, посредством электронных
                    приложений Яндекс, взаимоотношения с которыми на основании
                    поручения организовал Агрегатор. Под Водителем для целей
                    настоящей Оферты также понимается курьер, оказывающий услуги
                    курьерской доставки без автомобиля. Водитель гарантирует,
                    что: 1) Он будет самостоятельно уплачивать налоги и прочие
                    платежи в бюджет в соответствии с действующим
                    законодательством Кыргызской Республики, в течение всего
                    срока оказания услуг; 2) Он соблюдает все требования
                    действующего законодательства Кыргызской Республики
                    регулирующие оказание им услуг.
                </p>
                <p className={styles.desc}>
                    <span className={styles.semiBold}>Договор/Оферта</span> —
                    настоящий Публичный договор присоединения (публичная оферта)
                    размещенный на интернет сайте
                </p>
                <div className={styles.text2}>
                    <p className={styles.desc}>
                        <span className={styles.semiBold}>Сервисы Яндекса</span>{" "}
                        – принадлежащие ОсОО «Яндекс.Такси.Корп»: «Сервис
                        Яндекс.Такси»,  «Сервис Яндекс Go», «Сервис для
                        Водителей», каждый из данных сервисов находится вне
                        контроля Агрегатора, однако последний обязуется
                        представлять интересы Водителя при наличии споров об
                        оплате за оказанные Водителями Клиентам услуги.
                    </p>
                    <p className={styles.desc}>
                        <span className={styles.semiBold}>
                            «Сервис Яндекс.Такси, «Сервис Яндекс Go»
                        </span>{" "}
                        — программно-аппаратный комплекс, позволяющий Клиентам
                        размещать запросы на услуги по перевозке пассажиров и
                        багажа и/или иные транспортные услуги и/или услуги
                        курьерской доставки, и осуществляющий автоматическую
                        обработку и передачу запросов Клиентов Водителю.
                    </p>
                    <p className={styles.desc}>
                        <span className={styles.semiBold}>
                            «Сервис для Водителей (Яндекс.Про)»
                        </span>
                        — сервис, предназначенный для автоматического получения
                        и передачи заказов на перевозку пассажиров и багажа
                        легковым такси и/или иные транспортные услуги,
                        позволяющий взаимодействовать удаленно, обмениваясь
                        данными с Сервисом, а также предоставляющий Водителю
                        другие функциональные возможности, полное описание
                        которых приведено в руководстве по использованию Сервиса
                        для Водителя.{" "}
                    </p>
                    <p className={styles.desc}>
                        <span className={styles.semiBold}>Клиент</span> —
                        физическое лицо, использующее сервисы Яндекс через
                        мобильное приложение, для получения от Водителя услуги
                        перевозки, либо физическому лицу, связанному с
                        юридическим лицом, пользующемся услугой «Корпоративный
                        клиент».
                    </p>
                </div>
                <p className={styles.desc}>
                    <span className={styles.semiBold}>Платежная карточка</span>
                    — средство электронного платежа, которое содержит
                    информацию, позволяющую ее держателю посредством электронных
                    терминалов или других каналов связи осуществлять платежи.
                </p>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}> 1. ПРЕДМЕТ ДОГОВОРА</p>
                <div className={styles.box}>
                    <p className={styles.desc}>1.</p>
                    <div className={styles.clausesText}>
                        <p className={styles.desc}>
                            1.1. По поручению Доверителя Поверенный обязуется
                            обеспечить транзитные переводы от сервисов Яндекса
                            Водителю в случае осуществления Клиентами расчетов в
                            безналичном порядке, с использованием платежных
                            карточек, посредством заключения соглашения с
                            субагентом, представляющим платежные сервисы ОсОО
                            «BM Technologies» и/или ОсОО «Региональные платежные
                            системы» и/или ОсОО «Грин Телеком Сервис» или любой
                            другой платежной системы и/или платежного
                            агента/субагента на усмотрение Агрегатора выступая в
                            качестве платежного агента/субагента либо
                            осуществляя переводы через указанные платежные
                            системы.   Поверенный при исполнении обязательств,
                            вытекающих из настоящего раздела Оферты, не является
                            поставщиком платежных услуг, так как не оказывает
                            платежные услуги, предусмотренные законодательством
                            Кыргызской Республики. Поверенный при выполнении
                            своих обязательств, вытекающих из настоящего
                            разделом Оферты, использует услуги поставщиков
                            платежных услуг в соответствии с применимым
                            законодательством.
                        </p>
                        <p className={styles.desc}>
                            1.2. В случае наличия споров относительно стоимость
                            оказанных Доверителем услуг, Поверенный обязуется
                            представлять интересы Доверителя перед владельцем
                            сервисов Яндекс.
                        </p>
                        <p className={styles.desc}>
                            1.3. Доверитель и Поверенный взаимно обязуются
                            соблюдать все требования действующего
                            законодательства Кыргызской Республики.  {" "}
                        </p>
                        <p className={styles.desc}>
                            1.4. Для целей выполнения поручений Доверитель
                            наделяет Поверенного правами необходимыми для
                            выполнения поручений, и которые изложены в данном
                            Договоре.
                        </p>
                    </div>
                </div>
                <div className={styles.box}>
                    <p className={styles.desc}>2.</p>
                    <div className={styles.clausesText}>
                        <p className={styles.desc}>
                            {" "}
                            Ни одно из положений Договора не может
                            расцениваться, как: — найм на работу временную,
                            постоянную или по совместительству Агрегатором
                            Водителя. Водитель: а) не выполняет работу (трудовую
                            функцию) по определенной квалификации,
                            специальности, профессии или должности; б) не
                            подчиняется при выполнении своих обязательств
                            трудовому распорядку; в) не получает заработной
                            платы за оказанных услуги (труд);
                        </p>
                        <p className={styles.desc}>
                            — возложение обязательств на Агрегатора по оплате
                            налогов, сборов и предусмотренных действующим
                            законодательством Кыргызской Республики отчислений
                            за Водителя.
                        </p>
                        <p className={styles.desc}>
                            2.1. В случае если деятельность каждой из Сторон
                            станет лицензируемой, каждая Сторона несет
                            самостоятельно ответственность за получение
                            необходимых лицензий, разрешений и направление
                            необходимых уведомлений.
                        </p>
                        <div className={styles.miniBox}>
                            <p className={styles.desc}>
                                2.2. Доверитель для присоединения к Договору:{" "}
                            </p>
                            <p className={styles.desc}>
                                1) направляет посредством онлайн формы или по
                                телефонам Поверенного свои данные для
                                регистрации в Сервисах Яндекс, а Поверенный на
                                основании полученных от Водителя данных
                                организует регистрацию и присвоение Водителю
                                уникального номера в сервисах Яндекс;{" "}
                            </p>
                            <p className={styles.desc}>
                                2) Доверитель начинает оказывать услуги
                                перевозки с использованием поиска заказчиков,
                                посредством электронных приложений Яндекс,
                                взаимоотношения с которыми на основании
                                поручения организовал Агрегатор.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>
                    {" "}
                    2. ПОРЯДОК ОКАЗАНИЯ УСЛУГ И ОСУЩЕСТВЛЕНИЯ ВЗАИМОРАСЧЕТОВ
                </p>
                <div className={styles.miniBox2}>
                    <div className={styles.box}>
                        <p className={styles.desc}>1.</p>
                        <p className={styles.desc}>
                            {" "}
                            Услуги по Договору, оказываются как в интернете,
                            через сервисы Яндекс и субагента, представляющего
                            платежные сервисы ОсОО «BM Technologies» и/или ОсОО
                            «Региональные платежные системы» и/или ОсОО «Грин
                            Телеком Сервис» или любой другой платежной системы
                            и/или платежного агента/субагента на усмотрение
                            Агрегатора, в части перевода транзитных платежей в
                            пользу Водителя при безналичных расчетах Клиентов с
                            использованием платежных карточек, в рамках
                            осуществления функций оплаты через платежные
                            системы. 
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>2.</p>
                        <p className={styles.desc}>
                            {" "}
                            Водитель оказывает услуги по перевозке пассажиров и
                            багажа и/или иные транспортные услуги и/или услуги
                            курьерской доставки непосредственно Клиентам,
                            используя для их поиска функционал сервисов Яндекс.
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>3.</p>
                        <p className={styles.desc}>
                            {" "}
                            Для надлежащего оказания услуг по Клиентам
                            Доверитель вправе получать от Поверенного
                            необходимые разъяснения, информацию, дополнительные
                            документы и письменные указания, которые Поверенный
                            запрашивает от владельца сервисов Яндекс. 
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>4.</p>
                        <p className={styles.desc}>
                            {" "}
                            Поверенный запрашивает и предоставляет запрошенные
                            разъяснения, информацию, документы и указания в
                            максимально сжатые сроки. 
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>5.</p>
                        <p className={styles.desc}>
                            {" "}
                            Хранение информации, связанных с оказанием услуг
                            Клиентам осуществляется сервисами Яндекс с
                            отражением данной информации в мобильном приложении
                            Доверителя Поверенный также имеет доступ к этой
                            информации, для целей учета своего вознаграждения.
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>6.</p>
                        <p className={styles.desc}>
                            {" "}
                            При расчетах Клиента с Водителем в наличном порядке,
                            Водитель сразу получает свое вознаграждение и не
                            осуществляет, какой-либо сдачи наличных денег
                            куда-либо, данные по таким поездкам фиксируются
                            Сервисами Яндекс, и Поверенный учитывает
                            обязательство Доверителя по уплате комиссии в пользу
                            Поверенного и Сервисов Яндекс.
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>7.</p>
                        <p className={styles.desc}>
                            {" "}
                            При расчетах Клиента с Водителем в безналичном
                            порядке, с использованием платежных карточек
                            уплачиваемый Клиентом платеж за поездку направляется
                            в пользу сервисов Яндекса, который осуществляют учет
                            всех оказанных Водителем услуг и направляют данный
                            транзитных платеж Поверенному, который в свою
                            очередь направляет его Водителю, посредством услуг
                            предоставляемых агентом, представляющим платежные
                            сервисы ОсОО «BM Technologies» и/или ОсОО
                            «Региональные платежные системы» и/или ОсОО «Грин
                            Телеком Сервис» или любой другой платежной системы
                            и/или платежного агента/субагента на усмотрение
                            Агрегатора осуществляя все необходимые взаиморасчёты
                            с Водителем. 
                        </p>
                    </div>
                    <div className={styles.box}>
                        <p className={styles.desc}>8.</p>
                        <div className={styles.secondBox}>
                            <p className={styles.desc}>
                                {" "}
                                Агрегатор ежедневно получает данные о
                                начисленных доходах Доверителю Сервисом Яндекс
                                т.к. эти сервисы осуществляют регистрацию всех
                                операций Доверителя. Поверенным получает эти
                                данные от Сервисов Яндекса для выполнения
                                поручений по настоящему Договору и осуществления
                                расчетов с Сервисами Яндекс и Доверителем,
                                осуществляет удержание комиссий Поверенного (с
                                учетом поездок расчеты за которые Клиентами были
                                осуществлены в наличном порядке), после чего
                                направляет остаток суммы платежей Доверителю на
                                его платежную карточку. При этом в фискальном
                                чеке, Поверенный отражает только суммы комиссии
                                Поверенного, которая является его доходом. В 
                                том случае если Поверенный использует сервисы
                                отдельных фискализированных систем, с целью
                                обеспечения совершенной операции, то в
                                выдаваемом Клиенту чеке отражается сумма
                                операции определенная Сервисами Яндекс и
                                согласованная сторонами, а также отдельно сумма
                                комиссии, при этом если сумма комиссии по
                                техническим ограничениям фискализированных
                                систем не может быть выделена отдельно, то
                                признания суммы комиссии  в составе дохода
                                определяется на основании данных Сервисов
                                Яндекс, в размере и на условиях договора
                                заключенного между Сервисами Яндекс и
                                Поверенным.
                            </p>
                            <p className={styles.desc}>
                                Такие удержания денежных средств не будет
                                считаться Сторонами нарушением Поверенным
                                обязательств, принятых на себя в соответствии с
                                Договором.
                            </p>
                        </div>
                    </div>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>3. ОБЯЗАННОСТИ И ПРАВА СТОРОН</p>
                <div className={styles.text}>
                    <p className={styles.desc}>3.1. Поверенный обязан: </p>
                    <p className={styles.desc}>
                        3.1.1. качественно и в срок исполнять данные ему
                        поручения согласно раздела 1. настоящего Договора;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.1.2. сообщать Доверителю по его требованию все
                        сведения о ходе исполнения поручений;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.1.3. передать Доверителю без промедления все
                        полученное по услугам, оказанным Водителем Клиентам;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.1.4. по просьбе Доверителя без промедления представить
                        отчет по запросу.
                    </p>
                </div>
                <div className={styles.text}>
                    <p className={styles.desc}>3.2. Поверенный имеет право: </p>
                    <p className={styles.desc}>
                        3.2.1. в целях надлежащего исполнения услуг по
                        настоящему Договору без предварительного согласования с
                        Доверителем привлекать третьих лиц;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.2. Поверенный или агент, представляющим Поверенному
                        платежные сервисы ОсОО «BM Technologies» и/или ОсОО
                        «Региональные платежные системы» и/или ОсОО «Грин
                        Телеком Сервис» или любой другой платежной системы и/или
                        платежного агента/ субагента вправе производить изъятие
                        в бесспорном безакцептном порядке (без дополнительного
                        согласия Доверителя) с баланса Доверителя деньги,
                        подлежащие оплате Доверителю, а также в случаях,
                        предусмотренных законодательством Кыргызской Республики.
                        Присоединившись к настоящему Договору, Доверитель дает
                        свое безусловное согласие Поверенному на безакцептное
                        изъятие в соответствии с настоящим пунктом Договора
                        денег со своего баланса в платежных сервисах;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.3. получать от Доверителя уточнения и разъяснения по
                        выполняемым поручениям; {" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.4. в одностороннем порядке изменять размер
                        вознаграждения, взимаемого с Доверителя;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.5. Поверенный оставляет за собой право отказать
                        Доверителю в технической возможности оказывать услуги
                        Доверителю с/или без блокировкой/и денег на балансе
                        Доверителя, с указанием причины отказа и/или блокировки
                        средств, в том числе в случае возникновения обоснованных
                        сомнений в личности Доверителя или правомерности
                        действий Доверителя до момента выяснения указанных
                        причин. При этом Поверенный вправе требовать
                        предоставления дополнительной информации, подтверждающей
                        личность Доверителя или правомерность таких действий
                        Доверителя;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.6. привлекать представителей Доверителя в
                        необходимых случаях, для решения отдельных вопросов,
                        связанных с выполнением поручений;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.7. предоставлять полученные от Водителя данные и
                        информацию работникам и партнерам лиц, с которыми у
                        Поверенного заключены договоры;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.8. передоверять выполнение поручений в части или
                        полностью третьему лицу, на свое усмотрение с
                        обязательным согласованием такого лица с Доверителем до
                        момента совершения действий по передоверию;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.9. приостановить выполнение поручений если их
                        дальнейшей исполнение прямо вредит интересам Доверителя;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.10. в случае нарушения Водителем условий настоящей
                        Оферты ограничивать функциональные возможности
                        предоставляемых услуг;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.11. в случае прекращения Водителем оказания услуг по
                        перевозке пассажиров и багажа и/или иных транспортных
                        услуг и/или услуг курьерской доставки Клиентам в течение
                        длительного времени без надлежащего
                        уведомления, прекратить оказание услуг по Договору со
                        списанием денежных средств с баланса Водителя на счет
                        Поверенного, на что Доверитель дает согласие. В случае
                        обращения Доверителя к Поверенному и возобновления
                        выполнения услуг по Договору данные средства могут быть
                        возвращены на баланс Водителя, в ином случае данные
                        средства засчитываются в счет Вознаграждения Поверенного
                        по Договору;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.12. вести записи всех обращений и сеансов связи с
                        любыми представителями Водителя в целях разрешения
                        разногласий, спорных ситуаций, осуществления прав и
                        интересов Поверенного;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.2.13. расторгать договор в одностороннем порядке в
                        случае выявления незаконной деятельности Доверителя.
                    </p>
                </div>
                <div className={styles.text}>
                    <p className={styles.desc}>3.3. Доверитель обязан: </p>
                    <p className={styles.desc}>
                        3.3.1. предоставить Поверенному все информацию для
                        выполнения поручения согласно раздела 1. настоящего
                        Договора;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.2. обеспечить Поверенного средствами, необходимыми
                        для исполнения поручений, включая предоставление
                        необходимых данных для выполнения поручений Доверителя;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.3. Доверитель обязуется соблюдать законодательство
                        Кыргызской Республики и самостоятельно нести
                        ответственность, в случае невыполнения условий настоящей
                        Оферты и нарушения законодательства Кыргызской
                        Республики;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.4. Доверитель несет полную ответственность за свои
                        действия (бездействия), за обстоятельства, повлекшие
                        причинение морального и (или) материального вреда, а
                        также вреда жизни и здоровью вне зависимости от того,
                        мог ли он предвидеть возможность наступления такого
                        вреда и возможность его устранения или не мог.
                        Поверенный ни при каких обстоятельствах не может быть
                        привлечен в качестве Стороны по спорам между Доверителем
                        и третьими лицами, между Доверителем и органами
                        государственной власти;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.5. возместить Поверенному все понесенные расходы,
                        которые были необходимы для исполнения поручений;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.6. без промедления принять все исполненное
                        Поверенным в соответствии с настоящим Договором;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.7. Доверитель обязан по исполнении поручений
                        уплатить Поверенному вознаграждение в соответствии
                        условиями настоящего Договора;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.3.8. Доверитель обязуется соблюдать законодательство
                        Кыргызской Республики, подтверждает, что уведомлен о
                        наступлении гражданско-правовой, административной и
                        уголовной ответственности, в случае нарушения условий
                        настоящей Оферты и законодательства Кыргызской
                        Республики.{" "}
                    </p>
                </div>
                <div className={styles.text}>
                    <p className={styles.desc}>3.4. Доверитель имеет право: </p>
                    <p className={styles.desc}>
                        3.4.1. получать от Поверенного любую необходимую
                        информацию о ходе выполнения поручений;{" "}
                    </p>
                    <p className={styles.desc}>
                        3.4.2. получать от Поверенного все полученное по
                        совершенным в интересах Доверителя сделкам.
                    </p>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>
                    4. СУММА ДОГОВОРА, ПОРЯДОК И СРОКИ РАСЧЕТОВ
                </p>
                <div className={styles.text}>
                    <p className={styles.desc}>
                        4.1. Общая сумма Договора составляет сумму всех платежей
                        по настоящему договору в течение всего срока действия
                        настоящего Договора.{" "}
                    </p>
                    <p className={styles.desc}>
                        4.2. Доверитель производит оплату вознаграждения
                        Поверенного в порядке и в сроки, оговоренные в настоящем
                        Договоре и/или Сервисами Яндекс. {" "}
                    </p>
                    <p className={styles.desc}>
                        4.3. Форма, порядок и сроки оплаты суммы Договора могут
                        быть изменены.
                    </p>
                    <p className={styles.desc}>
                        4.4. Стороны согласны с тем, что вознаграждение
                        Поверенного будет выплачиваться с каждой поездки,
                        осуществленной Доверителем, в размере и на условиях
                        настоящего Договору и/или сервисов Яндекс.
                    </p>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}> 5. ОТВЕТСТВЕННОСТЬ СТОРОН</p>
                <div className={styles.text}>
                    <p className={styles.desc}>
                        5.1. За нарушение условий Договора Стороны несут
                        ответственность, установленную Договором и/или
                        действующим законодательством Кыргызской Республики.{" "}
                    </p>
                    <p className={styles.desc}>
                        5.2. В случае ненадлежащего исполнения Доверителем
                        обязательств по настоящему договору, что привело к
                        возникновению претензий со стороны Клиентов или других
                        третьих лиц, Доверитель несет самостоятельную
                        ответственность за нарушения перед Клиентами или
                        третьими лицами.
                    </p>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>6. ФОРС-МАЖОРНЫЕ ОБСТОЯТЕЛЬСТВА</p>
                <div className={styles.text}>
                    <p className={styles.desc}>
                        6.1. Стороны не несут ответственности за неисполнение
                        или ненадлежащее исполнение обязательств по настоящему
                        Договору, а также за ущерб, причиненный вследствие
                        наступления обстоятельств непреодолимой силы, вызванных
                        прямо или косвенно проявлением землетрясений, пожаров,
                        селей, наводнений, эпидемий, военных конфликтов или
                        переворотов, террористических актов, гражданских
                        волнений и забастовок, а также иных обстоятельств,
                        находящихся вне разумного контроля Сторон. Сроки
                        выполнения этих обязательств соразмерно отодвигаются на
                        время действия таких обстоятельств, если они значительно
                        влияют на выполнение в срок взятых на себя обязательств
                        в полном объеме или той их части, которая подлежит
                        выполнению после наступления обстоятельств форс-мажора.{" "}
                    </p>
                    <p className={styles.desc}>
                        6.2. Обе Стороны должны немедленно, письменно известить
                        друг друга о начале и окончании обстоятельств
                        форс-мажора, препятствующих выполнению обязательств по
                        настоящему Договору. {" "}
                    </p>
                    <p className={styles.desc}>
                        6.3. Сторона, ссылающаяся на форс-мажорные
                        обстоятельства, обязана предоставить для подтверждения
                        документ компетентного органа, при этом общеизвестные
                        факты в подтверждении не нуждаются.{" "}
                    </p>
                    <p className={styles.desc}>
                        6.4. В случае, если задержка в исполнении обязательств
                        из-за форс-мажорных обстоятельств будет действовать
                        более двух месяцев, или, если при наступлении данных
                        обстоятельств становится ясно, что они или их
                        последствия будут действовать более этого срока, Стороны
                        в возможно короткие сроки проведут переговоры с целью
                        определения приемлемых для них альтернативных способов
                        исполнения настоящего Договора.
                    </p>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>7. РАЗРЕШЕНИЕ СПОРОВ</p>
                <div className={styles.text}>
                    <p className={styles.desc}>
                        7.1. Стороны примут все меры для урегулирования всех
                        споров и разногласий, которые могут возникнуть при
                        выполнении настоящего Договора или в связи с ним, путем
                        переговоров между Сторонами.{" "}
                    </p>
                    <p className={styles.desc}>
                        7.2. В случае, если споры и разногласия не могут быть
                        решены путем переговоров, они должны быть рассмотрены в
                        соответствии с действующим законодательством Кыргызской
                        Республики.
                    </p>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>8. ОСОБЫЕ УСЛОВИЯ</p>
                <div className={styles.text}>
                    <p className={styles.desc}>
                        8.1. Все изменения и дополнения к настоящему Договору
                        имеют силу только в том случае, если они оформлены в
                        письменном виде и размещены на
                        сайте https://vostokpark.kg, причем документ,
                        датированный более поздним числом, имеет
                        преимущественную силу над более ранним.
                    </p>
                </div>
            </div>
            <div className={styles.clausesBox}>
                <p className={styles.title}>
                    9. СРОК ДЕЙСТВИЯ И ПОРЯДОК ИЗМЕНЕНИЯ, РАСТОРЖЕНИЯ ДОГОВОРА.
                </p>
                <div className={styles.text}>
                    <p>
                        9.1. Договор вступает в силу в силу с момента размещения
                        в сети Интернет на сайте https://vostokpark.kg и
                        действует до момента отзыва Оферты Поверенным. {" "}
                    </p>
                    <p>
                        9.2. Доверитель вправе выйти из Договора в одностороннем
                        порядке, уведомив Поверенного о принятом решении за один
                        месяц до дня выхода из Договора. Доверитель считается
                        вышедшим из Договора с даты, указанной в соответствующем
                        уведомлении, но не ранее одного месяца со дня получения
                        Поверенным данного уведомления.{" "}
                    </p>
                    <p>
                        9.3. Любая из Сторон может выйти из Договора по
                        основаниям, предусмотренным действующим
                        законодательством Кыргызской Республики, при этом выход
                        Поверенного из Договора прекращает его действие
                        полностью и расценивается, как досрочное расторжение.{" "}
                    </p>
                    <p>
                        9.4. Поверенный вправе отказаться от исполнения
                        настоящего Договора в отношении Доверителя, в случае
                        систематического неисполнения Доверителем (более двух
                        раз) своих обязанностей по Договору. В этом случае
                        Поверенный обязан любым способом уведомить Доверителя о
                        своем отказе от исполнения Договора. Со дня направления
                        Поверенным указанного уведомления Доверителю настоящий
                        Договор в отношении такого Доверителя считается
                        расторгнутым.{" "}
                    </p>
                    <p>
                        9.5. Поверенный вправе в одностороннем порядке вносить
                        изменения в текст настоящего Договора с обязательным
                        извещением об этом Доверителя, путем размещения
                        соответствующих изменений на интернет
                        сайте https://vostokpark.kg{" "}
                    </p>
                    <p>
                        9.6. Стороны согласны с тем, что деятельность Агрегатора
                        основана на настоящем Договоре и содержит исчерпывающий
                        список полномочий Агрегатора, предоставляемых ему
                        Доверителем, как Поверенному.{" "}
                    </p>
                    <p>
                        9.7. Стороны согласны с тем, что ввиду наличия Сервисов
                        Яндекс и характера поручений Доверителя Поверенному,
                        последний не предоставляет Доверителю, каких-либо
                        отчетов с приложением оправдательных документов. {" "}
                    </p>
                    <p>
                        9.8. Стороны согласны с тем, что Поверенный действуя в
                        интересах Доверителя вправе отступить от его указаний, и
                        в этом случае Поверенный освобожден от каких-либо
                        действий по согласованию и/или уведомлению, а также
                        последующему уведомлению о таких отступлениях
                        Доверителя. {" "}
                    </p>
                    <p>
                        9.9. Стороны согласны с тем и подтверждают, что
                        совершение Водителем действий, указанных в п. 1.7.
                        настоящего Договора считается акцептом настоящей
                        публичной оферты в соответствии со статьей 396, частью 2
                        статьи 398 Гражданского кодекса Кыргызской Республики.
                    </p>
                </div>
            </div>
        </section>
    );
};

export default Terms;
